// Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
//
//
// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
//
// - У нас є змінна test, якщо  не дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
//
//
// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
//
// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.
//
// - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.
//
// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!



// Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
//

   let time = +prompt('Введите время от 0 до 59');
if (time>=0 && time<=14) {
    document.write('<h1>Первая половина дня</h1>')
    console.log("Первая половина дня ")
}
else if(time>=15 && time<=29) {
    document.write('<h1>Вторая половина дня</h1>')
    console.log('Вторая половина дня')
}
else if(time>=30 && time<=45){
    document.write('<h1>Третяя половина дня</h1>')
    console.log('Третяя половина дня')

}
  else if (time>=46 &&time<=59){
    document.write("<h1>четвертая половина дня</h1>")
    console.log('Четвертая половина дня')
} else {
      console.log('Ошибка введите корректно данные')
}



// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

//
// let day = +prompt('Укажите день месяцв ');
//   if (day>=1 && day<=9){
//       document.write('<h2>Первая декада месяца</h2>')
//       console.log('Первая декада месяца')
//   }
//   else if(day>=10 && day<=19){
//       document.write('<h2>Вторая декада месяца</h2>')
//       console.log('Вторая декада месяца')
//   }
//   else if(day>=20 && day<=31){
//       document.write('<h2>Третяя декада месяца</h2>')
//       console.log('Третяя декада месяца')
//   } else{
//       console.log("Ошибка")
//   }
//
//
// // - У нас є змінна test, якщо  не дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
// //     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
//
//
// let test = 'test';
//
//     if (test === true){
//     console.log('Верно')
// }else{
//     console.log("Неверно")
// }


//  - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3


// let number = +prompt('Выведите число которое равняется 1,0,-3')
// if (number !== 0){
//   console.log('ВЕРНО')
//  } else {
//     console.log('НЕВЕРНО')
// }
// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.
//


// let dayOfWeek = +prompt('План на эту неделю')
// switch (dayOfWeek){
//     case 1:
//         document.write('<h1>Понедельник:Выйти на пробежку</h1>');
//         console.log('Понедельник:Выйти на пробежку');
//         break;
//     case 2:
//         document.write('<h1>Вторник:Забрать посылку</h1>');
//         console.log('Вторник:Забрать посылку');
//         break;
//
//     case 3:
//         document.write('<h1>Среда:Полить вазон</h1>');
//         console.log('Среда:Полить вазон');
//         break;
//
//     case 4:
//         document.write('<h1>Четвер:Оплатить комуналку</h1>');
//         console.log('Четвер:Оплатить комуналку');
//         break;
//     case 5:
//         document.write('<h1>Пятница:Сходить в театр</h1>');
//         console.log('Пятница:Сходить в театр');
//         break;
//     case 6:
//         document.write('<h1>Суббота:Убрать дом</h1>');
//         console.log('Суббота:Убрать дом');
//         break;
//     case 7:
//         document.write('<h1>Воскресенье:Поехать в Ашан</h1>');
//         console.log('Воскресенье:Поехать в Ашан');
//         break;
//     default:
//         confirm('Этого нет в списке');
//         console.log('Этого нет в списке');
// }



// - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.


 let year = +prompt('Введите количество дней в году');

 if(year % 2 === 0){
     console.log('Год Высокосный');
 }else {
     console.log('Год не Высокосный');
 }


// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!


let officialName = prompt('Какая «официальная название JavaScript?');
if(officialName === 'ECMAScript'){
   alert('Правильно');
} else{
   alert('Неправильно, официально - ECMAScript!');
 }

